Infineon/cmsis-packs/PSoC6_DFP/Cypress.PSoC6_DFP.pdsc
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx6.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx6_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6016BZI-F04">
        <compile   define="CY8C6016BZI_F04" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_01.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x20000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x80000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx6.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx6_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
    </family>
    <family Dfamily="PSoC 61" Dvendor="Cypress:19">
      <processor Pname="Cortex-M4" Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="150000000" />
      <description>
        PSoC 61 (Programmable Line): Cortex-M4 MCU series with programmable digital and analog peripherals, CapSense and crypto security.
      </description>
      <book name="README.txt" title="Cypress PSoC 6 DFP user guide"/>
      <book name="known_issues.txt" title="Cypress PSoC 6 DFP known issues"/>
      <debug Pname="Cortex-M4"  __ap="2" defaultResetSequence="ResetSystem"/>
      <sequences>
        <sequence name="DebugPortStart">
          <block info="Read DP CTRL/STAT">
            __var SW_DP_ABORT  = 0x0;
            __var DP_CTRL_STAT = 0x4;
            __var DP_SELECT    = 0x8;
            __var powered_down = 0;
            // Switch to DP Register Bank 0. Explicitly set APSEL to current AP selection
            WriteDP(DP_SELECT, __ap &lt;&lt; 24);
            // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
            powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
          </block>
          <control if="powered_down">
            <block info="Power Up System &amp; Debug">
              // Request Debug/System Power-Up
              // Ignore error here: even there is a polling in the next block, CMSIS-DAP transports reads DP->RDBUFF register
              // right after write to DP->CTRL_STAT. This will fail for some cases - for example if device is waking from DeepSleep.
              __errorcontrol = 1;
              WriteDP(DP_CTRL_STAT, 0x50000000);
              __errorcontrol = 0;
            </block>
            <!-- Wait for Power-Up Request to be acknowledged -->
            <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000" info="Wait for power acknowledged"/>
            <!-- CDBGRSTREQ on PSoC6 behaves like Power-On Reset. Not desired when starting the Debug Port
            <block info="Debug Reset">
              __errorcontrol = 1;
              // Request Debug Reset
              WriteDP(DP_CTRL_STAT, 0x54000000);
              // CDBGRSTREQ is equivalent to Power-On Reset and fully reboots the device.
              // Depending on the user application the reboot can take up to 600ms.
              DAP_Delay(600000);
              __errorcontrol = 0;
            </block>
            -->
            <!-- Wait for Debug Reset to be acknowledged, don't issue error on timeout to deal with improperly connected Debug Reset -->
            <!-- <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA8000000) != 0xA8000000" timeout="300000" info="Wait for Debug Reset Acknowledge"/> -->
            <!-- JTAG Specific Part of sequence -->
            <control if="(__protocol &amp; 0xFFFF) == 1">
              <block info="JTAG: Clear Sticky Bits">
                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                WriteDP(DP_CTRL_STAT, 0x50000F32);
              </block>
            </control>
            <!-- SWD Specific Part of sequence -->
            <control if="(__protocol &amp; 0xFFFF) == 2">
              <block info="SWD: Init SWD &amp; Clear Sticky Bits">
                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                WriteDP(DP_CTRL_STAT, 0x50000F00);
                // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                WriteDP(SW_DP_ABORT, 0x0000001E);
              </block>
            </control>
          </control>
        </sequence>
        <!-- HW Reset causes a reboot of the device which also resets debug.
             - Using this as a prereset is OK to potentially wake up the system from DeepSleep.
             - Using this in the middle of the debug session will break the connection unless recovery
               from a connection loss is supported by the debug IDE.
        -->
        <sequence name="ResetHardware">
          <block>
            __var nReset      = 0x80;
            __var canReadPins = 0;
            // Deassert nRESET line
            canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
          </block>
          <!-- Keep reset active for 50 ms -->
          <control while="1" timeout="50000"/>
          <control if="canReadPins">
            <!-- Assert nRESET line and wait max. 1s for recovery -->
            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
          </control>
          <control if="!canReadPins">
            <block>
              // Assert nRESET line
              DAP_SWJ_Pins(nReset, nReset, 0);
            </block>
            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control while="1" timeout="100000"/>
          </control>
          <block>
            // Give the PSoC6 bootloader time to finish (can be up to 600ms)
            DAP_Delay(600000);
          </block>
        </sequence>
      </sequences>
      <device Dname="CY8C6116BZI-F54">
        <compile   define="CY8C6116BZI_F54" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_01.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x20000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x80000" default="1" startup="1"/>

