Infineon/cmsis-packs/PSoC6_DFP/Cypress.PSoC6_DFP.pdsc
      <device Dname="CY8C614ABZI-S2F04">
        <compile   define="CY8C614ABZI_S2F04" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_02.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x100000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x200000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA.FLM"             start="0x10000000" size="0x00200000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_sect256KB.FLM"   start="0x10000000" size="0x00200000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C614AAZI-S2F04">
        <compile   define="CY8C614AAZI_S2F04" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_02.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x100000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x200000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA.FLM"             start="0x10000000" size="0x00200000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_sect256KB.FLM"   start="0x10000000" size="0x00200000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C614AFNI-S2F03">
        <compile   define="CY8C614AFNI_S2F03" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_02.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x100000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x200000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA.FLM"             start="0x10000000" size="0x00200000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_sect256KB.FLM"   start="0x10000000" size="0x00200000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
