Infineon/cmsis-packs/PSoC6_DFP/Cypress.PSoC6_DFP.pdsc
      <device Dname="CY8C6144AZI-S4F92">
        <compile   define="CY8C6144AZI_S4F92" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_04.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x20000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x40000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4.FLM"             start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4_sect128KB.FLM"   start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6144LQI-S4F92">
        <compile   define="CY8C6144LQI_S4F92" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_04.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x20000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x40000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4.FLM"             start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4_sect128KB.FLM"   start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6144AZI-S4F93">
        <compile   define="CY8C6144AZI_S4F93" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_04.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x20000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x40000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4.FLM"             start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4_sect128KB.FLM"   start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6144AZI-S4F82">
        <compile   define="CY8C6144AZI_S4F82" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_04.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x20000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x40000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4.FLM"             start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4_sect128KB.FLM"   start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6144LQI-S4F82">
        <compile   define="CY8C6144LQI_S4F82" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_04.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x20000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x40000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4.FLM"             start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4_sect128KB.FLM"   start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6144AZI-S4F83">
        <compile   define="CY8C6144AZI_S4F83" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_04.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x20000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x40000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4.FLM"             start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4_sect128KB.FLM"   start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6144AZI-S4F62">
        <compile   define="CY8C6144AZI_S4F62" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_04.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x20000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x40000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4.FLM"             start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4_sect128KB.FLM"   start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6144LQI-S4F62">
        <compile   define="CY8C6144LQI_S4F62" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_04.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x20000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x40000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4.FLM"             start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4_sect128KB.FLM"   start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6144AZI-S4F12">
        <compile   define="CY8C6144AZI_S4F12" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_04.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x20000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x40000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4.FLM"             start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4_sect128KB.FLM"   start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6144LQI-S4F12">
        <compile   define="CY8C6144LQI_S4F12" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_04.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x20000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x40000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4.FLM"             start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx4_sect128KB.FLM"   start="0x10000000" size="0x00040000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
    </family>
