Infineon/cmsis-packs/PSoC6_DFP/Cypress.PSoC6_DFP.pdsc
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx5.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx5_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6245LQI-S3D42">
        <compile   define="CY8C6245LQI_S3D42" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_03.svd"/>
        <debug     Pname="Cortex-M0p" svd="SVD/psoc6_03.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x40000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x80000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx5.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx5_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6245FNI-S3D41">
        <compile   define="CY8C6245FNI_S3D41" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_03.svd"/>
        <debug     Pname="Cortex-M0p" svd="SVD/psoc6_03.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x40000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x80000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx5.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx5_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6245AZI-S3D12">
        <compile   define="CY8C6245AZI_S3D12" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_03.svd"/>
        <debug     Pname="Cortex-M0p" svd="SVD/psoc6_03.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x40000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x80000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx5.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx5_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6245LQI-S3D12">
        <compile   define="CY8C6245LQI_S3D12" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_03.svd"/>
        <debug     Pname="Cortex-M0p" svd="SVD/psoc6_03.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x40000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x80000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx5.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx5_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6245FNI-S3D11">
        <compile   define="CY8C6245FNI_S3D11" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_03.svd"/>
        <debug     Pname="Cortex-M0p" svd="SVD/psoc6_03.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x40000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x80000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx5_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx5.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx5_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxA_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6245AZI-S3D02">
        <compile   define="CY8C6245AZI_S3D02" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_03.svd"/>
        <debug     Pname="Cortex-M0p" svd="SVD/psoc6_03.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x40000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x80000" default="1" startup="1"/>

