Infineon/cmsis-packs/PSoC6_DFP/Cypress.PSoC6_DFP.pdsc
      <device Dname="CY8C6347BZI-BLD34">
        <compile   define="CY8C6347BZI_BLD34" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_01.svd"/>
        <debug     Pname="Cortex-M0p" svd="SVD/psoc6_01.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x48000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x100000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx7.FLM"             start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx7_sect256KB.FLM"   start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx7.FLM"             start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx7_sect256KB.FLM"   start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6347BZI-BLD54">
        <compile   define="CY8C6347BZI_BLD54" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_01.svd"/>
        <debug     Pname="Cortex-M0p" svd="SVD/psoc6_01.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x48000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x100000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx7.FLM"             start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx7_sect256KB.FLM"   start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx7.FLM"             start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx7_sect256KB.FLM"   start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CYBLE-416045-02">
        <compile   define="CYBLE_416045_02" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_01.svd"/>
        <debug     Pname="Cortex-M0p" svd="SVD/psoc6_01.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x48000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x100000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx7.FLM"             start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx7_sect256KB.FLM"   start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx7.FLM"             start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx7_sect256KB.FLM"   start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6347FMI-BUD53">
        <compile   define="CY8C6347FMI_BUD53" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_01.svd"/>
        <debug     Pname="Cortex-M0p" svd="SVD/psoc6_01.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x48000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x100000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx7.FLM"             start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx7_sect256KB.FLM"   start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx7.FLM"             start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx7_sect256KB.FLM"   start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6347FMI-BUD13">
        <compile   define="CY8C6347FMI_BUD13" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_01.svd"/>
        <debug     Pname="Cortex-M0p" svd="SVD/psoc6_01.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x48000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x100000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx7.FLM"             start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xx7_sect256KB.FLM"   start="0x10000000" size="0x00100000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M0p" name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx7.FLM"             start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx7_sect256KB.FLM"   start="0x10000000" size="0x00100000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08026400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
