Infineon/cmsis-packs/PSoC6_DFP/Cypress.PSoC6_DFP.pdsc
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx6.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx6_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
      <device Dname="CY8C6336LQI-BLF42">
        <compile   define="CY8C6336LQI_BLF42" />
        <debug     Pname="Cortex-M4"  svd="SVD/psoc6_01.svd"/>
        <memory    name="IRAM1"       access="rwx" start="0x08000000" size="0x20000" default="1"/>
        <memory    name="IROM1"       access="rx"  start="0x10000000" size="0x80000" default="1" startup="1"/>

        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx6.FLM"             start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xx6_sect256KB.FLM"   start="0x10000000" size="0x00080000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_WFLASH.FLM"      start="0x14000000" size="0x00008000" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_USER.FLM" start="0x16000800" size="0x00000800" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_NAR.FLM"  start="0x16001A00" size="0x00000200" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_PKEY.FLM" start="0x16005A00" size="0x00000C00" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SFLASH_TOC2.FLM" start="0x16007C00" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="1" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_SMIF.FLM"        start="0x18000000" size="0x08000000" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
        <algorithm Pname="Cortex-M4"  name="Flash/CY8C6xxx_EFUSE.FLM"       start="0x90700000" size="0x00000400" RAMstart="0x08002400" RAMsize="0x8000" default ="0" style="Keil"/>
      </device>
    </subFamily>
    </family>
  </devices>

  <conditions>
    <condition id="PSoC 60">
      <description>PSoC 60 devices</description>
      <accept Dvendor="Cypress:19" Dname="CY8C6036BZI-F04"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6016BZI-F04"/>
    </condition>
    <condition id="PSoC 61">
      <description>PSoC 61 devices</description>
      <accept Dvendor="Cypress:19" Dname="CY8C6116BZI-F54"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6136BZI-F14"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6136BZI-F34"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6137BZI-F14"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6137BZI-F34"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6137BZI-F54"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6117BZI-F34"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6137FDI-F02"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6117FDI-F02"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6136FDI-F42"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6136FTI-F42"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6137WI-F54"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6117WI-F34"/>
      <accept Dvendor="Cypress:19" Dname="CY8C614ABZI-S2F04"/>
      <accept Dvendor="Cypress:19" Dname="CY8C614AAZI-S2F04"/>
      <accept Dvendor="Cypress:19" Dname="CY8C614AFNI-S2F03"/>
      <accept Dvendor="Cypress:19" Dname="CY8C614AAZI-S2F14"/>
      <accept Dvendor="Cypress:19" Dname="CY8C614ABZI-S2F44"/>
      <accept Dvendor="Cypress:19" Dname="CY8C614AAZI-S2F44"/>
      <accept Dvendor="Cypress:19" Dname="CY8C614AFNI-S2F43"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6148BZI-S2F44"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6148AZI-S2F44"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6148FNI-S2F43"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6145AZI-S3F72"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6145LQI-S3F72"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6145FNI-S3F71"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6145AZI-S3F62"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6145LQI-S3F62"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6145AZI-S3F42"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6145LQI-S3F42"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6145FNI-S3F41"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6145AZI-S3F12"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6145LQI-S3F12"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6145FNI-S3F11"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6145AZI-S3F02"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6145LQI-S3F02"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6144AZI-S4F92"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6144LQI-S4F92"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6144AZI-S4F93"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6144AZI-S4F82"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6144LQI-S4F82"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6144AZI-S4F83"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6144AZI-S4F62"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6144LQI-S4F62"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6144AZI-S4F12"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6144LQI-S4F12"/>
    </condition>
    <condition id="PSoC 62">
      <description>PSoC 62 devices</description>
      <accept Dvendor="Cypress:19" Dname="CY8C6246BZI-D04"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6247BZI-D44"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6247BZI-D34"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6247BZI-D54"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6247FDI-D02"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6247FDI-D32"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6247FDI-D52"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6247FTI-D52"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6247BZI-AUD54"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6247BFI-D54"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6247WI-D54"/>
      <accept Dvendor="Cypress:19" Dname="CY8C624ABZI-S2D44A0"/>
      <accept Dvendor="Cypress:19" Dname="CY8C624ABZI-S2D44"/>
      <accept Dvendor="Cypress:19" Dname="CY8C624AAZI-S2D44"/>
      <accept Dvendor="Cypress:19" Dname="CY8C624AFNI-S2D43"/>
      <accept Dvendor="Cypress:19" Dname="CY8C624ABZI-S2D04"/>
      <accept Dvendor="Cypress:19" Dname="CY8C624ABZI-S2D14"/>
      <accept Dvendor="Cypress:19" Dname="CY8C624AAZI-S2D14"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6248AZI-S2D14"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6248BZI-S2D44"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6248AZI-S2D44"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6248FNI-S2D43"/>
      <accept Dvendor="Cypress:19" Dname="CY8C624ABZI-D44"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6245AZI-S3D72"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6245LQI-S3D72"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6245FNI-S3D71"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6245AZI-S3D62"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6245LQI-S3D62"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6245AZI-S3D42"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6245LQI-S3D42"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6245FNI-S3D41"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6245AZI-S3D12"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6245LQI-S3D12"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6245FNI-S3D11"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6245AZI-S3D02"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6245LQI-S3D02"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6244AZI-S4D92"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6244LQI-S4D92"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6244AZI-S4D93"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6244AZI-S4D82"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6244LQI-S4D82"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6244AZI-S4D83"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6244AZI-S4D62"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6244LQI-S4D62"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6244AZI-S4D12"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6244LQI-S4D12"/>
    </condition>
