Infineon/cmsis-packs/PSoC6_DFP/Cypress.PSoC6_DFP.pdsc
    <condition id="PSoC 63">
      <description>PSoC 63 devices</description>
      <accept Dvendor="Cypress:19" Dname="CY8C6336BZI-BLF03"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6316BZI-BLF03"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6316BZI-BLF53"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6336BZI-BLD13"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347BZI-BLD43"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347BZI-BLD33"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347BZI-BLD53"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347FMI-BLD13"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347FMI-BLD43"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347FMI-BLD33"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347FMI-BLD53"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6337BZI-BLF13"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6336BZI-BLF04"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6316BZI-BLF04"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6316BZI-BLF54"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6336BZI-BLD14"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347BZI-BLD44"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347BZI-BLD34"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347BZI-BLD54"/>
      <accept Dvendor="Cypress:19" Dname="CYBLE-416045-02"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347FMI-BUD53"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347FMI-BUD13"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347FMI-BUD43"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347FMI-BUD33"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6336LQI-BLF02"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6336LQI-BLF42"/>
      <accept Dvendor="Cypress:19" Dname="CY8C6347LQI-BLD52"/>
    </condition>
    <condition id="PSoC 6">
      <description>PSoC 6 devices</description>
      <accept condition="PSoC 60"/>
      <accept condition="PSoC 61"/>
      <accept condition="PSoC 62"/>
      <accept condition="PSoC 63"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PSoC 6">
      <!-- This is a dummy startup implementation that emits a compiler error once
           this software component is enabled in the CMSIS RTE project configuration.
           It exists to silence PackChk WARNING M350: No 'Startup' component found.
           Refer to README.txt in the pack root directory for the guidance on the
           intended use of this CSMIS pack. -->
      <description>Dummy startup component, do not use</description>
      <files>
        <file category="doc" name="README.txt"/>
        <file category="source" name="Device/Source/startup_error.c" version="1.0.0"/>
      </files>
    </component>
  </components>
</package>
